ARM-software/CMSIS_5/CMSIS/DAP/Firmware/Examples/MCU-LINK/USBD1_LPC55xxx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2021 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        28. June 2021
 * $Revision:    V1.0
 *
 * Driver:       Driver_USBD1
 * Project:      USB1 High-Speed Device Driver for NXP LPC55xxx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                  Value
 *   ---------------------                  -----
 *   Connect to hardware via Driver_USBD# = 1
 * --------------------------------------------------------------------------
 * Defines used for driver configuration (at compile time):
 *
 *   USBD1_MAX_ENDPOINT_NUM: defines maximum number of IN/OUT Endpoint pairs 
 *                           that driver will support with Control Endpoint 0
 *                           not included, this value impacts driver memory
 *                           requirements
 *     - default value: 5
 *     - maximum value: 5
 *
 *   USBD1_OUT_EP0_BUF_SZ:   defines Out Endpoint0 buffer size (in Bytes)
 *   USBD1_IN_EP0_BUF_SZ:    defines In  Endpoint0 buffer size (in Bytes)
 *   USBD1_OUT_EP1_BUF_SZ:   defines Out Endpoint1 buffer size (in Bytes)
 *   USBD1_IN_EP1_BUF_SZ:    defines In  Endpoint1 buffer size (in Bytes)
 *   USBD1_OUT_EP2_BUF_SZ:   defines Out Endpoint2 buffer size (in Bytes)
 *   USBD1_IN_EP2_BUF_SZ:    defines In  Endpoint2 buffer size (in Bytes)
 *   USBD1_OUT_EP3_BUF_SZ:   defines Out Endpoint3 buffer size (in Bytes)
 *   USBD1_IN_EP3_BUF_SZ:    defines In  Endpoint3 buffer size (in Bytes)
 *   USBD1_OUT_EP4_BUF_SZ:   defines Out Endpoint4 buffer size (in Bytes)
 *   USBD1_IN_EP4_BUF_SZ:    defines In  Endpoint4 buffer size (in Bytes)
 *   USBD1_OUT_EP5_BUF_SZ:   defines Out Endpoint5 buffer size (in Bytes)
 *   USBD1_IN_EP5_BUF_SZ:    defines In  Endpoint5 buffer size (in Bytes)
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.0
 *    Initial release
 */

#include <stdint.h>
#include <string.h>

#include "Driver_USBD.h"

#include "RTE_Device.h"
#include "RTE_Components.h"

#include "fsl_common.h"
#include "fsl_power.h"
#include "fsl_clock.h"
#include "fsl_reset.h"

#include "USB_LPC55xxx.h"

// Endpoint buffer must be 64Byte aligned
#define ALIGN_64(n)                    (n == 0U ? (0U) : (64U * (((n - 1U) / 64U) + 1U)))

#ifndef USBD1_MAX_ENDPOINT_NUM
#define USBD1_MAX_ENDPOINT_NUM         (5U)
#endif
#if    (USBD1_MAX_ENDPOINT_NUM > 5)
#error  Too many Endpoints, maximum IN/OUT Endpoint pairs that this driver supports is 5 !!!
#endif

// Endpoint Bufer size definitions
#ifndef USBD1_OUT_EP0_BUF_SZ
#define USBD1_OUT_EP0_BUF_SZ           (64U)
#endif
#ifndef USBD1_IN_EP0_BUF_SZ
#define USBD1_IN_EP0_BUF_SZ            (64U)
#endif
#define USBD1_OUT_EP0_BUF_SZ_64        (ALIGN_64(USBD1_OUT_EP0_BUF_SZ))
#define USBD1_IN_EP0_BUF_SZ_64         (ALIGN_64(USBD1_IN_EP0_BUF_SZ))

#if (USBD1_MAX_ENDPOINT_NUM > 0)
#ifndef USBD1_OUT_EP1_BUF_SZ
#define USBD1_OUT_EP1_BUF_SZ           (1024U)
#endif
#ifndef USBD1_IN_EP1_BUF_SZ
#define USBD1_IN_EP1_BUF_SZ            (1024U)
#endif                     
#else
#define USBD1_OUT_EP1_BUF_SZ           (0U)
#define USBD1_IN_EP1_BUF_SZ            (0U)
#endif
#define USBD1_OUT_EP1_BUF_SZ_64        (ALIGN_64(USBD1_OUT_EP1_BUF_SZ))
#define USBD1_IN_EP1_BUF_SZ_64         (ALIGN_64(USBD1_IN_EP1_BUF_SZ))

#if (USBD1_MAX_ENDPOINT_NUM > 1)
#ifndef USBD1_OUT_EP2_BUF_SZ
#define USBD1_OUT_EP2_BUF_SZ           (1024U)
#endif
#ifndef USBD1_IN_EP2_BUF_SZ
#define USBD1_IN_EP2_BUF_SZ            (1024U)
#endif
#else
#define USBD1_OUT_EP2_BUF_SZ           (0U)
#define USBD1_IN_EP2_BUF_SZ            (0U)
#endif
#define USBD1_OUT_EP2_BUF_SZ_64        (ALIGN_64(USBD1_OUT_EP2_BUF_SZ))
#define USBD1_IN_EP2_BUF_SZ_64         (ALIGN_64(USBD1_IN_EP2_BUF_SZ))

#if (USBD1_MAX_ENDPOINT_NUM > 2)
#ifndef USBD1_OUT_EP3_BUF_SZ
#define USBD1_OUT_EP3_BUF_SZ           (1024U)
#endif
#ifndef USBD1_IN_EP3_BUF_SZ
#define USBD1_IN_EP3_BUF_SZ            (1024U)
#endif
#else
#define USBD1_OUT_EP3_BUF_SZ           (0U)
#define USBD1_IN_EP3_BUF_SZ            (0U)
#endif
#define USBD1_OUT_EP3_BUF_SZ_64        (ALIGN_64(USBD1_OUT_EP3_BUF_SZ))
#define USBD1_IN_EP3_BUF_SZ_64         (ALIGN_64(USBD1_IN_EP3_BUF_SZ))

#if (USBD1_MAX_ENDPOINT_NUM > 3)
#ifndef USBD1_OUT_EP4_BUF_SZ
#define USBD1_OUT_EP4_BUF_SZ           (1024U)
#endif
#ifndef USBD1_IN_EP4_BUF_SZ
#define USBD1_IN_EP4_BUF_SZ            (1024U)
#endif
#else
#define USBD1_OUT_EP4_BUF_SZ           (0U)
#define USBD1_IN_EP4_BUF_SZ            (0U)
#endif
#define USBD1_OUT_EP4_BUF_SZ_64        (ALIGN_64(USBD1_OUT_EP4_BUF_SZ))
#define USBD1_IN_EP4_BUF_SZ_64         (ALIGN_64(USBD1_IN_EP4_BUF_SZ))

#if (USBD1_MAX_ENDPOINT_NUM > 4)
#ifndef USBD1_OUT_EP5_BUF_SZ
#define USBD1_OUT_EP5_BUF_SZ           (1024U)
#endif
#ifndef USBD1_IN_EP5_BUF_SZ
#define USBD1_IN_EP5_BUF_SZ            (1024U)
#endif
#else
#define USBD1_OUT_EP5_BUF_SZ           (0U)
#define USBD1_IN_EP5_BUF_SZ            (0U)
#endif
#define USBD1_OUT_EP5_BUF_SZ_64        (ALIGN_64(USBD1_OUT_EP5_BUF_SZ))
#define USBD1_IN_EP5_BUF_SZ_64         (ALIGN_64(USBD1_IN_EP5_BUF_SZ))

#define USBD1_OUT_EP0_BUF_OFFSET       (0U)
#define USBD1_IN_EP0_BUF_OFFSET        (USBD1_OUT_EP0_BUF_SZ_64)
#define USBD1_OUT_EP1_BUF_OFFSET       (USBD1_IN_EP0_BUF_OFFSET  + USBD1_IN_EP0_BUF_SZ_64)
#define USBD1_IN_EP1_BUF_OFFSET        (USBD1_OUT_EP1_BUF_OFFSET + USBD1_OUT_EP1_BUF_SZ_64)
#define USBD1_OUT_EP2_BUF_OFFSET       (USBD1_IN_EP1_BUF_OFFSET  + USBD1_IN_EP1_BUF_SZ_64)
#define USBD1_IN_EP2_BUF_OFFSET        (USBD1_OUT_EP2_BUF_OFFSET + USBD1_OUT_EP2_BUF_SZ_64)
#define USBD1_OUT_EP3_BUF_OFFSET       (USBD1_IN_EP2_BUF_OFFSET  + USBD1_IN_EP2_BUF_SZ_64)
#define USBD1_IN_EP3_BUF_OFFSET        (USBD1_OUT_EP3_BUF_OFFSET + USBD1_OUT_EP3_BUF_SZ_64)
#define USBD1_OUT_EP4_BUF_OFFSET       (USBD1_IN_EP3_BUF_OFFSET  + USBD1_IN_EP3_BUF_SZ_64)
#define USBD1_IN_EP4_BUF_OFFSET        (USBD1_OUT_EP4_BUF_OFFSET + USBD1_OUT_EP4_BUF_SZ_64)
#define USBD1_OUT_EP5_BUF_OFFSET       (USBD1_IN_EP4_BUF_OFFSET  + USBD1_IN_EP4_BUF_SZ_64)
#define USBD1_IN_EP5_BUF_OFFSET        (USBD1_OUT_EP5_BUF_OFFSET + USBD1_OUT_EP5_BUF_SZ_64)

