ARM-software/CMSIS_5/CMSIS/DAP/Firmware/Examples/MCU-LINK/USBD1_LPC55xxx.c
#define USBD_EP_BUFFER_SZ              (USBD1_OUT_EP0_BUF_SZ_64 + USBD1_IN_EP0_BUF_SZ_64 + \
                                        USBD1_OUT_EP1_BUF_SZ_64 + USBD1_IN_EP1_BUF_SZ_64 + \
                                        USBD1_OUT_EP2_BUF_SZ_64 + USBD1_IN_EP2_BUF_SZ_64 + \
                                        USBD1_OUT_EP3_BUF_SZ_64 + USBD1_IN_EP3_BUF_SZ_64 + \
                                        USBD1_OUT_EP4_BUF_SZ_64 + USBD1_IN_EP4_BUF_SZ_64 + \
                                        USBD1_OUT_EP5_BUF_SZ_64 + USBD1_IN_EP5_BUF_SZ_64 )

#if (USBD_EP_BUFFER_SZ > 0x3C00U)
  #error "Endpoint buffers do not fit into RAMx!"
#endif

#define EP_NUM(ep_addr)   (ep_addr & ARM_USB_ENDPOINT_NUMBER_MASK)
#define EP_IDX(ep_addr)  ((ep_addr & 0x80U) ? ((EP_NUM(ep_addr)) * 2U + 1U)  : (ep_addr * 2U))
#define CMD_IDX(ep_addr) ((ep_addr & 0x80U) ? ((EP_NUM(ep_addr)) * 4U + 2U)  : (ep_addr * 4U))

// Resource allocation
static uint8_t           ep_buf[USBD_EP_BUFFER_SZ]                __attribute__((section(".bss.ARM.__at_0x40100000")));
static EP_CMD            ep_cmd[(USBD1_MAX_ENDPOINT_NUM + 1) * 4] __attribute__((section(".bss.ARM.__at_0x40103C00")));
static EP_TRANSFER       ep_transfer[(USBD1_MAX_ENDPOINT_NUM + 1) * 2];

// Global variables
static ARM_USBD_STATE    usbd_state;
static uint8_t           usbd_flags;

static uint8_t           setup_packet[8];     // Setup packet data
static volatile uint8_t  setup_received;      // Setup packet received

static ARM_USBD_SignalDeviceEvent_t   SignalDeviceEvent;
static ARM_USBD_SignalEndpointEvent_t SignalEndpointEvent;

static const EP endpoint[] = {
  // Endpoint 0
  { &(ep_cmd[0]),  &(ep_buf[USBD1_OUT_EP0_BUF_OFFSET]), &(ep_transfer[0]), USBD1_OUT_EP0_BUF_OFFSET, },
  { &(ep_cmd[2]),  &(ep_buf[USBD1_IN_EP0_BUF_OFFSET]),  &(ep_transfer[1]), USBD1_IN_EP0_BUF_OFFSET,  },

#if (USBD1_MAX_ENDPOINT_NUM > 0U)
  // Endpoint 1
  { &(ep_cmd[4]),  &(ep_buf[USBD1_OUT_EP1_BUF_OFFSET]), &(ep_transfer[2]), USBD1_OUT_EP1_BUF_OFFSET, },
  { &(ep_cmd[6]),  &(ep_buf[USBD1_IN_EP1_BUF_OFFSET]),  &(ep_transfer[3]), USBD1_IN_EP1_BUF_OFFSET,  },
#endif

#if (USBD1_MAX_ENDPOINT_NUM > 1U)
  // Endpoint 2
  { &(ep_cmd[8]),  &(ep_buf[USBD1_OUT_EP2_BUF_OFFSET]), &(ep_transfer[4]), USBD1_OUT_EP2_BUF_OFFSET, },
  { &(ep_cmd[10]), &(ep_buf[USBD1_IN_EP2_BUF_OFFSET]),  &(ep_transfer[5]), USBD1_IN_EP2_BUF_OFFSET,  },
#endif

#if (USBD1_MAX_ENDPOINT_NUM > 2U)
  // Endpoint 3
  { &(ep_cmd[12]), &(ep_buf[USBD1_OUT_EP3_BUF_OFFSET]), &(ep_transfer[6]), USBD1_OUT_EP3_BUF_OFFSET, },
  { &(ep_cmd[14]), &(ep_buf[USBD1_IN_EP3_BUF_OFFSET]),  &(ep_transfer[7]), USBD1_IN_EP3_BUF_OFFSET,  },
#endif

#if (USBD1_MAX_ENDPOINT_NUM > 3U)
  // Endpoint 4
  { &(ep_cmd[16]), &(ep_buf[USBD1_OUT_EP4_BUF_OFFSET]), &(ep_transfer[8]), USBD1_OUT_EP4_BUF_OFFSET, },
  { &(ep_cmd[18]), &(ep_buf[USBD1_IN_EP4_BUF_OFFSET]),  &(ep_transfer[9]), USBD1_IN_EP4_BUF_OFFSET,  },
#endif
#if (USBD1_MAX_ENDPOINT_NUM > 4U)
  // Endpoint 5
  { &(ep_cmd[16]), &(ep_buf[USBD1_OUT_EP5_BUF_OFFSET]), &(ep_transfer[8]), USBD1_OUT_EP5_BUF_OFFSET, },
  { &(ep_cmd[18]), &(ep_buf[USBD1_IN_EP5_BUF_OFFSET]),  &(ep_transfer[9]), USBD1_IN_EP5_BUF_OFFSET,  },
#endif
};


// USBD Driver *****************************************************************

#define ARM_USBD_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,0)

// Driver Version
static const ARM_DRIVER_VERSION usbd_driver_version = { ARM_USBD_API_VERSION, ARM_USBD_DRV_VERSION };

// Driver Capabilities
static const ARM_USBD_CAPABILITIES usbd_driver_capabilities = {
#if (USBD_VBUS_DETECT == 1)
  1U,   // VBUS Detection
  1U,   // Event VBUS On
  1U,   // Event VBUS Off
#else
  0U,   // VBUS Detection
  0U,   // Event VBUS On
  0U    // Event VBUS Off
#endif
};

/**
  \fn          void USBD_Reset (void)
  \brief       Reset USB Endpoint settings and variables.
*/
static void USBD_Reset (void) {
  // Clear USB Endpoint command/status list
  memset((void *)ep_cmd, 0, sizeof(ep_cmd));

  memset((void *)&usbd_state, 0, sizeof(usbd_state));
}

// USBD Driver functions

/**
  \fn          ARM_DRIVER_VERSION USBD_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USBD_GetVersion (void) { return usbd_driver_version; }

/**
  \fn          ARM_USBD_CAPABILITIES USBD_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_USBD_CAPABILITIES
*/
static ARM_USBD_CAPABILITIES USBD_GetCapabilities (void) { return usbd_driver_capabilities; }

/**
  \fn          int32_t USBD_Initialize (ARM_USBD_SignalDeviceEvent_t   cb_device_event,
                                        ARM_USBD_SignalEndpointEvent_t cb_endpoint_event)
  \brief       Initialize USB Device Interface.
  \param[in]   cb_device_event    Pointer to \ref ARM_USBD_SignalDeviceEvent
  \param[in]   cb_endpoint_event  Pointer to \ref ARM_USBD_SignalEndpointEvent
  \return      \ref execution_status
*/
static int32_t USBD_Initialize (ARM_USBD_SignalDeviceEvent_t   cb_device_event,
                                ARM_USBD_SignalEndpointEvent_t cb_endpoint_event) {

  if ((usbd_flags & USBD_DRIVER_FLAG_INITIALIZED) != 0U) { return ARM_DRIVER_OK; }

  SignalDeviceEvent   = cb_device_event;
  SignalEndpointEvent = cb_endpoint_event;

  usbd_flags =  USBD_DRIVER_FLAG_INITIALIZED;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_Uninitialize (void)
  \brief       De-initialize USB Device Interface.
  \return      \ref execution_status
*/
static int32_t USBD_Uninitialize (void) {

  usbd_flags &= ~USBD_DRIVER_FLAG_INITIALIZED;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_PowerControl (ARM_POWER_STATE state)
  \brief       Control USB Device Interface Power.
  \param[in]   state  Power state
  \return      \ref execution_status
*/
static int32_t USBD_PowerControl (ARM_POWER_STATE state) {

  switch (state) {
    case ARM_POWER_OFF:
      NVIC_DisableIRQ      (USB1_IRQn);                 // Disable interrupt
      NVIC_ClearPendingIRQ (USB1_IRQn);                 // Clear pending interrupt

