ARM-software/CMSIS_5/CMSIS/DAP/Firmware/Examples/MCU-LINK/USBD1_LPC55xxx.c
      usbd_flags &= ~USBD_DRIVER_FLAG_POWERED;          // Clear powered flag

      RESET_PeripheralReset(kUSB1D_RST_SHIFT_RSTn);     // Reset USB1 Device controller
      RESET_PeripheralReset(kUSB1_RST_SHIFT_RSTn);      // Reset USB1 PHY
      RESET_PeripheralReset(kUSB1RAM_RST_SHIFT_RSTn);   // Reset USB1 RAM controller

      // Disable USB IP clock
      SYSCON->AHBCLKCTRLSET[2] &= ~SYSCON_AHBCLKCTRL2_USB1_RAM(1);
      SYSCON->AHBCLKCTRLSET[2] &= ~SYSCON_AHBCLKCTRL2_USB1_DEV(1);
      SYSCON->AHBCLKCTRLSET[2] &= ~SYSCON_AHBCLKCTRL2_USB1_PHY(1);

      // Clear USB Endpoint command/status list
      memset((void *)ep_cmd, 0, sizeof(ep_cmd));

      // Clear Endpoint transfer structure
      memset((void *)ep_transfer, 0, sizeof(ep_transfer));
      break;

    case ARM_POWER_FULL:
      if ((usbd_flags & USBD_DRIVER_FLAG_INITIALIZED) == 0U) { return ARM_DRIVER_ERROR; }
      if ((usbd_flags & USBD_DRIVER_FLAG_POWERED)     != 0U) { return ARM_DRIVER_OK; }

      // Enable USB IP clock
      CLOCK_EnableUsbhs0PhyPllClock(kCLOCK_UsbPhySrcExt, 16000000U);
      CLOCK_EnableUsbhs0DeviceClock(kCLOCK_UsbSrcUnused, 0U);

      // Enable device operation (through USB1 Host PORTMODE register)
      CLOCK_EnableClock(kCLOCK_Usbh1);
      USBHSH->PORTMODE  = USBHSH_PORTMODE_SW_PDCOM_MASK;
      USBHSH->PORTMODE |= USBHSH_PORTMODE_DEV_ENABLE_MASK;
      CLOCK_DisableClock(kCLOCK_Usbh1);

      // Setup PHY
      USBPHY->PWD = 0U;
      USBPHY->CTRL_SET = USBPHY_CTRL_SET_ENAUTOCLR_CLKGATE_MASK;
      USBPHY->CTRL_SET = USBPHY_CTRL_SET_ENAUTOCLR_PHY_PWD_MASK;

      // Clear USB RAM
      memset((void *)FSL_FEATURE_USBHSD_USB_RAM_BASE_ADDRESS, 0, FSL_FEATURE_USBHSD_USB_RAM);

      // Reset variables and endpoint settings
      USBD_Reset ();

      // Set Endpoint list start address
      USBHSD->EPLISTSTART = (uint32_t)ep_cmd;

      // Set USB Data buffer start address
      USBHSD->DATABUFSTART = (uint32_t)ep_buf;

      // Enable device status interrupt
      USBHSD->INTEN = USB_INTSTAT_DEV_INT_MASK;

      usbd_flags |=  USBD_DRIVER_FLAG_POWERED;

      // Enable USB interrupt
      NVIC_EnableIRQ (USB1_IRQn);
      break;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceConnect (void)
  \brief       Connect USB Device.
  \return      \ref execution_status
*/
static int32_t USBD_DeviceConnect (void) {

  if ((usbd_flags & USBD_DRIVER_FLAG_POWERED) == 0U) { return ARM_DRIVER_ERROR; }

  // Attach Device
  USBHSD->DEVCMDSTAT |= USB_DEVCMDSTAT_DCON_MASK;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceDisconnect (void)
  \brief       Disconnect USB Device.
  \return      \ref execution_status
*/
static int32_t USBD_DeviceDisconnect (void) {

  if ((usbd_flags & USBD_DRIVER_FLAG_POWERED) == 0U) { return ARM_DRIVER_ERROR; }

  // Detach Device
  USBHSD->DEVCMDSTAT &= ~USB_DEVCMDSTAT_DCON_MASK;

  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_USBD_STATE USBD_DeviceGetState (void)
  \brief       Get current USB Device State.
  \return      Device State \ref ARM_USBD_STATE
*/
static ARM_USBD_STATE USBD_DeviceGetState (void) {
  ARM_USBD_STATE dev_state = { 0U, 0U, 0U };

  if ((usbd_flags & USBD_DRIVER_FLAG_POWERED) == 0U) { return dev_state; }


  return usbd_state;
}

/**
  \fn          int32_t USBD_DeviceRemoteWakeup (void)
  \brief       Trigger USB Remote Wakeup.
  \return      \ref execution_status
*/
static int32_t USBD_DeviceRemoteWakeup (void) {

  if ((usbd_flags & USBD_DRIVER_FLAG_POWERED) == 0U) { return ARM_DRIVER_ERROR; }

  // Force remote wakeup
  USBHSD->DEVCMDSTAT &= ~USB_DEVCMDSTAT_DSUS_MASK;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceSetAddress (uint8_t dev_addr)
  \brief       Set USB Device Address.
  \param[in]   dev_addr  Device Address
  \return      \ref execution_status
*/
static int32_t USBD_DeviceSetAddress (uint8_t dev_addr) {

  if ((usbd_flags & USBD_DRIVER_FLAG_POWERED) == 0U) { return ARM_DRIVER_ERROR; }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_ReadSetupPacket (uint8_t *setup)
  \brief       Read setup packet received over Control Endpoint.
  \param[out]  setup  Pointer to buffer for setup packet
  \return      \ref execution_status
*/
static int32_t USBD_ReadSetupPacket (uint8_t *setup) {
  if ((usbd_flags & USBD_DRIVER_FLAG_POWERED) == 0U) { return ARM_DRIVER_ERROR; }
  if (setup_received                          == 0U) { return ARM_DRIVER_ERROR; }

  setup_received = 0U;
  memcpy(setup, setup_packet, 8);

  if (setup_received != 0U) {           // If new setup packet was received while this was being read
    return ARM_DRIVER_ERROR;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointConfigure (uint8_t  ep_addr,
                                               uint8_t  ep_type,
                                               uint16_t ep_max_packet_size)
  \brief       Configure USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   ep_type  Endpoint Type (ARM_USB_ENDPOINT_xxx)
  \param[in]   ep_max_packet_size Endpoint Maximum Packet Size
  \return      \ref execution_status
*/
static int32_t USBD_EndpointConfigure (uint8_t  ep_addr,
                                       uint8_t  ep_type,
                                       uint16_t ep_max_packet_size) {
  uint8_t ep_num, ep_idx;
  EP const * ep;
  volatile uint32_t DBG1 = 0;
  volatile uint32_t DBG2 = 0;
  volatile uint32_t DBG3 = 0;
  volatile uint32_t DBG4 = 0;
  volatile uint32_t DBG5 = ep_addr;
  volatile uint32_t DBG6 = ep_type;
  volatile uint32_t DBG7 = ep_max_packet_size;

  ep_num = EP_NUM(ep_addr);
  ep_idx = EP_IDX(ep_addr);
  ep     = &endpoint[ep_idx];

  if (ep_num > USBD1_MAX_ENDPOINT_NUM) {
    DBG1++;
    return ARM_DRIVER_ERROR;
  }
  if ((usbd_flags & USBD_DRIVER_FLAG_POWERED) == 0U) {
    DBG2++;
    return ARM_DRIVER_ERROR;
  }

  if (ep->cmd->active == 1U) {
    // Endpoint is "owned" by hardware
    DBG3++;
    return ARM_DRIVER_ERROR_BUSY;
  }

