ARM-software/CMSIS_5/CMSIS/DAP/Firmware/Examples/MCU-LINK/USBD1_LPC55xxx.c
  if (ep_max_packet_size > ((ep+1)->buf_offset - ep->buf_offset)) {
    // Configured Endpoint buffer size is too small
    DBG4++;
    return ARM_DRIVER_ERROR;
  }

  // Clear Endpoint command/status
  memset((void *)ep->cmd, 0, sizeof(EP_CMD) * 2U);

  // Clear Endpoint transfer structure
  memset((void *)ep->transfer, 0, sizeof(EP_TRANSFER));

  ep_transfer[ep_idx].max_packet_sz = ep_max_packet_size & ARM_USB_ENDPOINT_MAX_PACKET_SIZE_MASK;

  ep->cmd->buff_addr_offset = ep->buf_offset >> 6;

  if (ep_num != 0U) {
    ep->cmd->ep_disabled  = 1U;

    // Reset data toggle
    ep->cmd->ep_type_periodic = 0U;
    ep->cmd->toggle_value     = 0U;
    ep->cmd->toggle_reset     = 1U;

    switch (ep_type) {
      case ARM_USB_ENDPOINT_CONTROL:
        break;
      case ARM_USB_ENDPOINT_ISOCHRONOUS:
        ep->cmd->toggle_value     = 0U;
        ep->cmd->ep_type_periodic = 1U;
        break;
      case ARM_USB_ENDPOINT_BULK:
        ep->cmd->toggle_value     = 0U;
        ep->cmd->ep_type_periodic = 0U;
        break;
      case ARM_USB_ENDPOINT_INTERRUPT:
        ep->cmd->toggle_value     = 1U;
        ep->cmd->ep_type_periodic = 1U;
        break;
      default:                            // Unknown endpoint type
        return ARM_DRIVER_ERROR;
    }
    ep->cmd->ep_disabled  = 0U;

    /* Double-buffering not configured/used */
    ep->cmd[1].buff_addr_offset = ep->buf_offset >> 6;
    ep->cmd[1].ep_disabled = 1U;
  }

  // Clear Endpoint Interrupt
  USBHSD->INTSTAT = USB_INT_EP(ep_idx);

  // Enable endpoint interrupt
  USBHSD->INTEN  |= USB_INT_EP(ep_idx);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointUnconfigure (uint8_t ep_addr)
  \brief       Unconfigure USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      \ref execution_status
*/
static int32_t USBD_EndpointUnconfigure (uint8_t ep_addr) {
  uint8_t ep_num, ep_idx;
  EP const * ep;

  ep_num = EP_NUM(ep_addr);
  ep_idx = EP_IDX(ep_addr);
  ep     = &endpoint[ep_idx];

  if (ep_num > USBD1_MAX_ENDPOINT_NUM)               { return ARM_DRIVER_ERROR; }
  if ((usbd_flags & USBD_DRIVER_FLAG_POWERED) == 0U) { return ARM_DRIVER_ERROR; }

  if (ep->cmd->active == 1U) {
    // Endpoint is "owned" by hardware
    return ARM_DRIVER_ERROR_BUSY;
  }

  // Disable endpoint interrupt
  USBHSD->INTEN &= ~USB_INT_EP(ep_idx);

  if (ep->cmd->active) {
    USBHSD->EPSKIP |= (1U << ep_idx);
    while (USBHSD->EPSKIP & (1U << ep_idx));
  }

  // Clear Endpoint command/status
  memset((void *)ep->cmd, 0, sizeof(EP_CMD) * 2U);

  ep->cmd->ep_disabled = 1U;

  // Clear Endpoint Interrupt
  USBHSD->INTSTAT = USB_INT_EP(ep_idx);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointStall (uint8_t ep_addr, bool stall)
  \brief       Set/Clear Stall for USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   stall  Operation
                - \b false Clear
                - \b true Set
  \return      \ref execution_status
*/
static int32_t USBD_EndpointStall (uint8_t ep_addr, bool stall) {
  uint8_t ep_num;
  EP const * ep;

  ep_num = EP_NUM(ep_addr);
  ep     = &endpoint[EP_IDX(ep_addr)];

  if (ep_num > USBD1_MAX_ENDPOINT_NUM)               { return ARM_DRIVER_ERROR; }
  if ((usbd_flags & USBD_DRIVER_FLAG_POWERED) == 0U) { return ARM_DRIVER_ERROR; }

  if (ep->cmd->active == 1U) {
    // Endpoint is "owned" by hardware
    return ARM_DRIVER_ERROR_BUSY;
  }

  if (stall != 0U) {
    // Set Endpoint stall
    ep->cmd->stall = 1U;
  } else {
    ep->cmd->toggle_value     = 0U;
    ep->cmd->toggle_reset     = 1U;

    // Clear Stall
    ep->cmd->stall = 0U;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointTransfer (uint8_t ep_addr, uint8_t *data, uint32_t num)
  \brief       Read data from or Write data to USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[out]  data Pointer to buffer for data to read or with data to write
  \param[in]   num  Number of data bytes to transfer
  \return      \ref execution_status
*/
static int32_t USBD_EndpointTransfer (uint8_t ep_addr, uint8_t *data, uint32_t num) {
  uint8_t      ep_num, ep_idx;
  EP const * ep;

  ep_num = EP_NUM(ep_addr);
  ep_idx = EP_IDX(ep_addr);
  ep     = &endpoint[ep_idx];

  if (ep_num > USBD1_MAX_ENDPOINT_NUM)               { return ARM_DRIVER_ERROR; }
  if ((usbd_flags & USBD_DRIVER_FLAG_POWERED) == 0U)  { return ARM_DRIVER_ERROR; }

  if (ep->cmd->active == 1U) {
    // Endpoint is "owned" by hardware
    return ARM_DRIVER_ERROR_BUSY;
  }

  ep->transfer->num = num;
  ep->transfer->buf = data;
  ep->transfer->num_transferred_total = 0U;
  if (num > ep->transfer->max_packet_sz) { num = ep->transfer->max_packet_sz; }

  if (ep_addr & ARM_USB_ENDPOINT_DIRECTION_MASK) {
    // Copy data into IN Endpoint buffer
    memcpy (ep->buf, ep->transfer->buf, num);
  }

  ep->cmd->buff_addr_offset = ep->buf_offset >> 6;

  ep->transfer->num_transferring = num;

  // Set number of bytes to send/receive
  ep->cmd->NBytes = num;

  // Activate endpoint
  ep->cmd->active |= 1U;

  return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t USBD_EndpointTransferGetResult (uint8_t ep_addr)
  \brief       Get result of USB Endpoint transfer.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      number of successfully transferred data bytes
*/
static uint32_t USBD_EndpointTransferGetResult (uint8_t ep_addr) {

  if (EP_NUM(ep_addr) > USBD1_MAX_ENDPOINT_NUM) { return 0U; }

  return (ep_transfer[EP_IDX(ep_addr)].num_transferred_total);
}

/**
  \fn          int32_t USBD_EndpointTransferAbort (uint8_t ep_addr)
  \brief       Abort current USB Endpoint transfer.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      \ref execution_status
*/
static int32_t USBD_EndpointTransferAbort (uint8_t ep_addr) {
  uint8_t      ep_num, ep_idx;
  EP const * ep;

