ARM-software/CMSIS_5/CMSIS/DAP/Firmware/Examples/MCU-LINK/USBD1_LPC55xxx.c
  ep_num = EP_NUM(ep_addr);
  ep_idx = EP_IDX(ep_addr);
  ep     = &endpoint[ep_idx];

  if (ep_num > USBD1_MAX_ENDPOINT_NUM)               { return ARM_DRIVER_ERROR; }
  if ((usbd_flags & USBD_DRIVER_FLAG_POWERED) == 0U) { return ARM_DRIVER_ERROR; }

  // Disable endpoint interrupt
  USBHSD->INTEN  &= ~USB_INT_EP(ep_idx);

  if (ep->cmd->active == 1U) {
    USBHSD->EPSKIP |= (1U << EP_IDX(ep_addr));
    while (USBHSD->EPSKIP & (1U << EP_IDX(ep_addr)));
    ep->cmd->active = 0U;
  }

  // Clear transfer info
  ep->transfer->num                   = 0U;
  ep->transfer->num_transferred_total = 0U;
  ep->transfer->num_transferring      = 0U;

  // Clear Endpoint Interrupt
  USBHSD->INTSTAT = USB_INT_EP(ep_idx);

  // Enable endpoint interrupt
  USBHSD->INTEN  |= USB_INT_EP(ep_idx);

  return ARM_DRIVER_OK;
}

/**
  \fn          uint16_t USBD_GetFrameNumber (void)
  \brief       Get current USB Frame Number.
  \return      Frame Number
*/
static uint16_t USBD_GetFrameNumber (void) {

  if ((usbd_flags & USBD_DRIVER_FLAG_POWERED) == 0U) { return 0; }

  return ((USBHSD->INFO & USB_INFO_FRAME_NR_MASK) >> USB_INFO_FRAME_NR_SHIFT);
}

/**
  \fn          void USB1_IRQHandler (void)
  \brief       USB1 Device Interrupt Routine (IRQ).
*/
void USB1_IRQHandler (void) {
  uint32_t num, ep_idx, intstat, cmdstat, dev_evt = 0U;
  uint16_t val;
  EP const * ep;

  intstat = USBHSD->INTSTAT & USBHSD->INTEN;
  cmdstat = USBHSD->DEVCMDSTAT;

  // Clear interrupt flags
  USBHSD->INTSTAT = intstat;

  // Device Status interrupt
  if (intstat & USB_INTSTAT_DEV_INT_MASK) {

    // Reset
    if (cmdstat & USB_DEVCMDSTAT_DRES_C_MASK) {
      USBD_Reset ();
      usbd_state.active = 1U;
      usbd_state.speed  = ARM_USB_SPEED_FULL;
      USBHSD->DEVCMDSTAT |= USB_DEVCMDSTAT_DRES_C_MASK | USB_DEVCMDSTAT_DEV_EN_MASK;
      SignalDeviceEvent(ARM_USBD_EVENT_RESET);

      if (((USBHSD->DEVCMDSTAT & USBHSD_DEVCMDSTAT_Speed_MASK) >> USBHSD_DEVCMDSTAT_Speed_SHIFT) == 2U) {
        SignalDeviceEvent(ARM_USBD_EVENT_HIGH_SPEED);
      }
    }

    // Suspend
    if (cmdstat & USB_DEVCMDSTAT_DSUS_MASK) {
      usbd_state.active = 0U;
      USBHSD->DEVCMDSTAT |= USB_DEVCMDSTAT_DSUS_MASK;
      SignalDeviceEvent(ARM_USBD_EVENT_SUSPEND);
    }

#if (USBD_VBUS_DETECT == 1)
    // Disconnect
    if (cmdstat & USB_DEVCMDSTAT_DCON_C) {
      usbd_state.active = 0U;
      usbd_state.vbus   = 0U;
      LPC_USB->DEVCMDSTAT |= USB_DEVCMDSTAT_DCON_C;
      SignalDeviceEvent(ARM_USBD_EVENT_VBUS_OFF);
    }

    // VBUS De-bounced
    if (cmdstat & USB_DEVCMDSTAT_VBUS_DEBOUNCED) {
      usbd_state.vbus   = 1U;
      SignalDeviceEvent(ARM_USBD_EVENT_VBUS_ON);
    }
#endif
  }

  // Endpoint interrupt
  if (intstat & USB_INT_EP_MSK) {
    for (ep_idx = 0; ep_idx <= USBD1_MAX_ENDPOINT_NUM * 2U; ep_idx += 2U) {

      if (intstat & (USB_INT_EP(ep_idx))) {

        // Clear Interrupt status
        USBHSD->INTSTAT = (1 << ep_idx);
        // Setup Packet
        if ((ep_idx == 0U) && ((cmdstat & USB_DEVCMDSTAT_SETUP_MASK) != 0U)) {
          ep_cmd[0].stall = 0U;
          ep_cmd[1].stall = 0U;
          ep_cmd[2].stall = 0U;
          ep_cmd[3].stall = 0U;

          USBHSD->DEVCMDSTAT |= USB_DEVCMDSTAT_SETUP_MASK;
          memcpy(setup_packet, ep_buf, 8);

          // Analyze Setup packet for SetAddress
          val = setup_packet[0] | (setup_packet[1] << 8);
          if (val == 0x0500U) {
            val = (setup_packet[2] | (setup_packet[3] << 8)) & USB_DEVCMDSTAT_DEV_ADDR_MASK;
            // Set device address
            USBHSD->DEVCMDSTAT = (USBHSD->DEVCMDSTAT & ~USB_DEVCMDSTAT_DEV_ADDR_MASK) |
                                   USB_DEVCMDSTAT_DEV_ADDR(val) | USB_DEVCMDSTAT_DEV_EN_MASK;
          }

          setup_received = 1U;
          if (SignalEndpointEvent != NULL) {
            SignalEndpointEvent(0U, ARM_USBD_EVENT_SETUP);
          }
        } else {
        // OUT Packet
          ep = &endpoint[ep_idx];

          num = ep->transfer->num_transferring - ep->cmd->NBytes;

          // Copy EP data
          memcpy (ep->transfer->buf, ep->buf, num);

          ep->transfer->buf                   += num;
          ep->transfer->num_transferred_total += num;

          // Check if all OUT data received:
          //  - data terminated with ZLP or short packet or
          //  - all required data received
          if ((ep->transfer->num_transferred_total == ep->transfer->num) || 
              (num == 0U) || (num != ep->transfer->max_packet_sz)) {

            if (SignalEndpointEvent != NULL) {
              SignalEndpointEvent(ep_idx / 2U, ARM_USBD_EVENT_OUT);
            }
          } else {
            // Remaining data to transfer
            num = ep->transfer->num - ep->transfer->num_transferred_total;
            if (num > ep->transfer->max_packet_sz) { num = ep->transfer->max_packet_sz; }

            ep->transfer->num_transferring = num;
            ep->cmd->NBytes                = num;
            ep->cmd->buff_addr_offset      = ep->buf_offset >> 6;

            // Activate EP to receive next packet
            ep->cmd->active = 1U;
          }
        }
      }
    }

    // IN Packet
    for (ep_idx = 1; ep_idx <= USBD1_MAX_ENDPOINT_NUM * 2U; ep_idx += 2U) {

      if (intstat & (USB_INT_EP(ep_idx))) {
        // Clear Interrupt status
        USBHSD->INTSTAT = (1 << ep_idx);

        ep = &endpoint[ep_idx];

        ep->transfer->buf                   += ep->transfer->num_transferring;
        ep->transfer->num_transferred_total += ep->transfer->num_transferring;

        if (ep->transfer->num_transferred_total == ep->transfer->num) {
          // All data has been transfered
          if (SignalEndpointEvent != NULL) {
            SignalEndpointEvent(0x80 | (ep_idx / 2), ARM_USBD_EVENT_IN);
          }
        } else {
          // Still data to transfer
          num = ep->transfer->num - ep->transfer->num_transferred_total;
          if (num > ep->transfer->max_packet_sz) {
            // Remaining data bigger than max packet
            num = ep->transfer->max_packet_sz;
          }

          ep->transfer->num_transferring = num;

          // Copy data into IN Endpoint buffer
          memcpy (ep->buf, ep->transfer->buf, num);

          ep->cmd->buff_addr_offset = ep->buf_offset >> 6;

          // Set number of bytes to send
          ep->cmd->NBytes = num;

          // Activate EP to send next packet
          ep->cmd->active = 1U;
        }
      }
    }
  }
}

ARM_DRIVER_USBD Driver_USBD1 = {
  USBD_GetVersion,
  USBD_GetCapabilities,
  USBD_Initialize,
  USBD_Uninitialize,
  USBD_PowerControl,
  USBD_DeviceConnect,
  USBD_DeviceDisconnect,
  USBD_DeviceGetState,
  USBD_DeviceRemoteWakeup,
  USBD_DeviceSetAddress,
  USBD_ReadSetupPacket,
  USBD_EndpointConfigure,
  USBD_EndpointUnconfigure,
  USBD_EndpointStall,
  USBD_EndpointTransfer,
  USBD_EndpointTransferGetResult,
  USBD_EndpointTransferAbort,
  USBD_GetFrameNumber
};
